chcbaram/stm32f4_disc/Exam01_Led/LIB_HW/Core/Hw_Regs.h
//----------------------------------------------------------------------------
//    프로그램명 	: 하드웨어 레지스터 Define
//
//    만든이     	: 
//
//    날  짜     	:
//
//    최종 수정  	:
//
//    MPU_Type		:
//
//    파일명     	: Hw_Regs.h
//----------------------------------------------------------------------------


#ifndef _HW_REGS_H_
#define _HW_REGS_H_



//-- PWR - F429
//
#define REG_PWR_BASE					0x40007000
#define REG_PWR_CR						(*(volatile unsigned long *)(REG_PWR_BASE + 0x0000))
#define REG_PWR_CSR						(*(volatile unsigned long *)(REG_PWR_BASE + 0x0004))



//-- RCC (reset and clock control ) - F429
//
#define REG_RCC_BASE					0x40023800
#define REG_RCC_CR						(*(volatile unsigned long *)(REG_RCC_BASE + 0x0000))
#define REG_RCC_PLLCFGR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0004))
#define REG_RCC_CFGR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0008))
#define REG_RCC_CIR						(*(volatile unsigned long *)(REG_RCC_BASE + 0x000C))
#define REG_RCC_AHB1RSTR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0010))
#define REG_RCC_AHB2RSTR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0014))
#define REG_RCC_AHB3RSTR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0018))
#define REG_RCC_APB1RSTR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0020))
#define REG_RCC_APB2RSTR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0024))
#define REG_RCC_AHB1ENR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0030))
#define REG_RCC_AHB2ENR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0034))
#define REG_RCC_AHB3ENR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0038))
#define REG_RCC_APB1ENR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0040))
#define REG_RCC_APB2ENR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0044))
#define REG_RCC_AHB1LPENR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0050))
#define REG_RCC_AHB2LPENR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0054))
#define REG_RCC_AHB3LPENR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0058))
#define REG_RCC_APB1LPENR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0060))
#define REG_RCC_APB2LPENR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0064))
#define REG_RCC_BDCR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0070))
#define REG_RCC_CSR						(*(volatile unsigned long *)(REG_RCC_BASE + 0x0074))
#define REG_RCC_SSCGR					(*(volatile unsigned long *)(REG_RCC_BASE + 0x0080))
#define REG_RCC_PLLI2SCFGR				(*(volatile unsigned long *)(REG_RCC_BASE + 0x0084))



//-- FLASH Memory - F429
//
#define REG_FLASH_BASE					0x40023C00
#define REG_FLASH_ACR					(*(volatile unsigned long *)(REG_FLASH_BASE + 0x0000))
#define REG_FLASH_KEYR					(*(volatile unsigned long *)(REG_FLASH_BASE + 0x0004))
#define REG_FLASH_OPTKEYR				(*(volatile unsigned long *)(REG_FLASH_BASE + 0x0008))
#define REG_FLASH_SR					(*(volatile unsigned long *)(REG_FLASH_BASE + 0x000C))
#define REG_FLASH_CR					(*(volatile unsigned long *)(REG_FLASH_BASE + 0x0010))
#define REG_FLASH_OTPCR					(*(volatile unsigned long *)(REG_FLASH_BASE + 0x0014))
#define REG_FLASH_OTPCR1				(*(volatile unsigned long *)(REG_FLASH_BASE + 0x0018))



//-- USART1
//
#define REG_USART1_BASE					0x40013800
#define REG_USART1_SR					(*(volatile unsigned long *)(REG_USART1_BASE + 0x0000))
#define REG_USART1_DR					(*(volatile unsigned long *)(REG_USART1_BASE + 0x0004))
#define REG_USART1_BRR					(*(volatile unsigned long *)(REG_USART1_BASE + 0x0008))
#define REG_USART1_CR1					(*(volatile unsigned long *)(REG_USART1_BASE + 0x000C))
#define REG_USART1_CR2					(*(volatile unsigned long *)(REG_USART1_BASE + 0x0010))
#define REG_USART1_CR3					(*(volatile unsigned long *)(REG_USART1_BASE + 0x0014))
#define REG_USART1_GTPR					(*(volatile unsigned long *)(REG_USART1_BASE + 0x0018))



//-- USART2
//
#define REG_USART2_BASE					0x40004400
#define REG_USART2_SR					(*(volatile unsigned long *)(REG_USART2_BASE + 0x0000))
#define REG_USART2_DR					(*(volatile unsigned long *)(REG_USART2_BASE + 0x0004))
#define REG_USART2_BRR					(*(volatile unsigned long *)(REG_USART2_BASE + 0x0008))
#define REG_USART2_CR1					(*(volatile unsigned long *)(REG_USART2_BASE + 0x000C))
#define REG_USART2_CR2					(*(volatile unsigned long *)(REG_USART2_BASE + 0x0010))
#define REG_USART2_CR3					(*(volatile unsigned long *)(REG_USART2_BASE + 0x0014))
#define REG_USART2_GTPR					(*(volatile unsigned long *)(REG_USART2_BASE + 0x0018))



//-- AFIO
//
#define REG_AFIO_BASE					0x40010000
#define REG_AFIO_EVCR					(*(volatile unsigned long *)(REG_AFIO_BASE + 0x0000))
#define REG_AFIO_MAPR					(*(volatile unsigned long *)(REG_AFIO_BASE + 0x0004))
#define REG_AFIO_EXTICR1				(*(volatile unsigned long *)(REG_AFIO_BASE + 0x0008))
#define REG_AFIO_EXTICR2				(*(volatile unsigned long *)(REG_AFIO_BASE + 0x000C))
#define REG_AFIO_EXTICR3				(*(volatile unsigned long *)(REG_AFIO_BASE + 0x0010))
#define REG_AFIO_EXTICR4				(*(volatile unsigned long *)(REG_AFIO_BASE + 0x0014))
#define REG_AFIO_MAPR2					(*(volatile unsigned long *)(REG_AFIO_BASE + 0x001C))



//-- GPIO - F429
//
#define REG_GPIOA_BASE					0x40020000
#define REG_GPIOA_MODER					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0000))
#define REG_GPIOA_OTYPER				(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0004))
#define REG_GPIOA_OSPEEDR				(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0008))
#define REG_GPIOA_PUPDR					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x000C))
#define REG_GPIOA_IDR					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0010))
#define REG_GPIOA_ODR					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0014))
#define REG_GPIOA_BSRR					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0018))
#define REG_GPIOA_LCKR					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x001C))
#define REG_GPIOA_AFRL					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0020))
#define REG_GPIOA_AFRH					(*(volatile unsigned long *)(REG_GPIOA_BASE + 0x0024))


#define REG_GPIOB_BASE					0x40020400
#define REG_GPIOB_MODER					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0000))
#define REG_GPIOB_OTYPER				(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0004))
#define REG_GPIOB_OSPEEDR				(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0008))
#define REG_GPIOB_PUPDR					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x000C))
#define REG_GPIOB_IDR					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0010))
#define REG_GPIOB_ODR					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0014))
#define REG_GPIOB_BSRR					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0018))
#define REG_GPIOB_LCKR					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x001C))
#define REG_GPIOB_AFRL					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0020))
#define REG_GPIOB_AFRH					(*(volatile unsigned long *)(REG_GPIOB_BASE + 0x0024))


#define REG_GPIOC_BASE					0x40020800
#define REG_GPIOC_MODER					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0000))
#define REG_GPIOC_OTYPER				(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0004))
#define REG_GPIOC_OSPEEDR				(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0008))
#define REG_GPIOC_PUPDR					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x000C))
#define REG_GPIOC_IDR					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0010))
#define REG_GPIOC_ODR					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0014))
#define REG_GPIOC_BSRR					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0018))
#define REG_GPIOC_LCKR					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x001C))
#define REG_GPIOC_AFRL					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0020))
#define REG_GPIOC_AFRH					(*(volatile unsigned long *)(REG_GPIOC_BASE + 0x0024))


