chcbaram/stm32f4_disc/Exam01_Led/LIB_HW/Core/Hw_Regs.h
#define REG_GPIOD_BASE					0x40020C00
#define REG_GPIOD_MODER					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0000))
#define REG_GPIOD_OTYPER				(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0004))
#define REG_GPIOD_OSPEEDR				(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0008))
#define REG_GPIOD_PUPDR					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x000C))
#define REG_GPIOD_IDR					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0010))
#define REG_GPIOD_ODR					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0014))
#define REG_GPIOD_BSRR					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0018))
#define REG_GPIOD_LCKR					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x001C))
#define REG_GPIOD_AFRL					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0020))
#define REG_GPIOD_AFRH					(*(volatile unsigned long *)(REG_GPIOD_BASE + 0x0024))


#define REG_GPIOE_BASE					0x40021000
#define REG_GPIOE_MODER					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0000))
#define REG_GPIOE_OTYPER				(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0004))
#define REG_GPIOE_OSPEEDR				(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0008))
#define REG_GPIOE_PUPDR					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x000C))
#define REG_GPIOE_IDR					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0010))
#define REG_GPIOE_ODR					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0014))
#define REG_GPIOE_BSRR					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0018))
#define REG_GPIOE_LCKR					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x001C))
#define REG_GPIOE_AFRL					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0020))
#define REG_GPIOE_AFRH					(*(volatile unsigned long *)(REG_GPIOE_BASE + 0x0024))


#define REG_GPIOF_BASE					0x40021400
#define REG_GPIOF_MODER					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0000))
#define REG_GPIOF_OTYPER				(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0004))
#define REG_GPIOF_OSPEEDR				(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0008))
#define REG_GPIOF_PUPDR					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x000C))
#define REG_GPIOF_IDR					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0010))
#define REG_GPIOF_ODR					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0014))
#define REG_GPIOF_BSRR					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0018))
#define REG_GPIOF_LCKR					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x001C))
#define REG_GPIOF_AFRL					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0020))
#define REG_GPIOF_AFRH					(*(volatile unsigned long *)(REG_GPIOF_BASE + 0x0024))


#define REG_GPIOG_BASE					0x40021800
#define REG_GPIOG_MODER					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0000))
#define REG_GPIOG_OTYPER				(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0004))
#define REG_GPIOG_OSPEEDR				(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0008))
#define REG_GPIOG_PUPDR					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x000C))
#define REG_GPIOG_IDR					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0010))
#define REG_GPIOG_ODR					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0014))
#define REG_GPIOG_BSRR					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0018))
#define REG_GPIOG_LCKR					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x001C))
#define REG_GPIOG_AFRL					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0020))
#define REG_GPIOG_AFRH					(*(volatile unsigned long *)(REG_GPIOG_BASE + 0x0024))



//-- NVIC
//
#define REG_NVIC_BASE					0xE000E100
#define REG_NVIC_ISER(x)				(*(volatile unsigned long *)(REG_NVIC_BASE + 0x0000 + 4*(x)))
#define REG_NVIC_ICER(x)				(*(volatile unsigned long *)(REG_NVIC_BASE + 0x0080 + 4*(x)))
#define REG_NVIC_ISPR(x)				(*(volatile unsigned long *)(REG_NVIC_BASE + 0x0100 + 4*(x)))
#define REG_NVIC_ICPR(x)				(*(volatile unsigned long *)(REG_NVIC_BASE + 0x0180 + 4*(x)))
#define REG_NVIC_IABR(x)				(*(volatile unsigned long *)(REG_NVIC_BASE + 0x0200 + 4*(x)))



//-- SCB
//
#define REG_SCB_BASE					0xE000ED00
#define REG_SCB_ACTLR					(*(volatile unsigned long *)(0xE000E008))
#define REG_SCB_CPUID					(*(volatile unsigned long *)(REG_SCB_BASE + 0x0000))
#define REG_SCB_ICSR					(*(volatile unsigned long *)(REG_SCB_BASE + 0x0004))
#define REG_SCB_VTOR					(*(volatile unsigned long *)(REG_SCB_BASE + 0x0008))
#define REG_SCB_AIRCR					(*(volatile unsigned long *)(REG_SCB_BASE + 0x000C))
#define REG_SCB_SCR						(*(volatile unsigned long *)(REG_SCB_BASE + 0x0010))
#define REG_SCB_CCR						(*(volatile unsigned long *)(REG_SCB_BASE + 0x0014))
#define REG_SCB_SHPR1					(*(volatile unsigned long *)(REG_SCB_BASE + 0x0018))
#define REG_SCB_SHPR2					(*(volatile unsigned long *)(REG_SCB_BASE + 0x001C))
#define REG_SCB_SHPR3					(*(volatile unsigned long *)(REG_SCB_BASE + 0x0020))
#define REG_SCB_SHCRS					(*(volatile unsigned long *)(REG_SCB_BASE + 0x0024))
#define REG_SCB_CFSR					(*(volatile unsigned long *)(REG_SCB_BASE + 0x0028))

#define REG_SCB_CPACR					(*(volatile unsigned long *)(0xE000ED88))
#define REG_SCB_FPCCR					(*(volatile unsigned long *)(0xE000EF34))
#define REG_SCB_FPCAR					(*(volatile unsigned long *)(0xE000EF38))
#define REG_SCB_FPDSCR					(*(volatile unsigned long *)(0xE000EF3C))





//-- STK ( SysTick )
//
#define REG_STK_BASE					0xE000E010
#define REG_STK_CTRL					(*(volatile unsigned long *)(REG_STK_BASE + 0x0000))
#define REG_STK_LOAD					(*(volatile unsigned long *)(REG_STK_BASE + 0x0004))
#define REG_STK_VAL						(*(volatile unsigned long *)(REG_STK_BASE + 0x0008))
#define REG_STK_CALIB					(*(volatile unsigned long *)(REG_STK_BASE + 0x000C))



//-- EXTI 
//
#define REG_EXTI_BASE					0x40010400
#define REG_EXTI_IMR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0000))
#define REG_EXTI_EMR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0004))
#define REG_EXTI_RTSR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0008))
#define REG_EXTI_FTSR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x000C))
#define REG_EXTI_SWIER					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0010))
#define REG_EXTI_PR						(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0014))



//-- I2C
//
#define REG_I2C1_BASE					0x40005400
#define REG_I2C1_CR1					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x0000))
#define REG_I2C1_CR2					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x0004))
#define REG_I2C1_OAR1					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x0008))
#define REG_I2C1_OAR2					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x000C))
#define REG_I2C1_DR						(*(volatile unsigned long *)(REG_I2C1_BASE + 0x0010))
#define REG_I2C1_SR1					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x0014))
#define REG_I2C1_SR2					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x0018))
#define REG_I2C1_CCR					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x001C))
#define REG_I2C1_TRISE					(*(volatile unsigned long *)(REG_I2C1_BASE + 0x0020))


#define REG_I2C2_BASE					0x40005800
#define REG_I2C2_CR1					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x0000))
#define REG_I2C2_CR2					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x0004))
#define REG_I2C2_OAR1					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x0008))
#define REG_I2C2_OAR2					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x000C))
#define REG_I2C2_DR						(*(volatile unsigned long *)(REG_I2C2_BASE + 0x0010))
#define REG_I2C2_SR1					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x0014))
#define REG_I2C2_SR2					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x0018))
#define REG_I2C2_CCR					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x001C))
#define REG_I2C2_TRISE					(*(volatile unsigned long *)(REG_I2C2_BASE + 0x0020))



